app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "email" = ?, "updated_at" = ?, "user_id" = ? WHERE "friends"."id" = ?  [["email", "mihndim16@gmail.com "], ["updated_at", "2021-04-09 16:31:12.295477"], ["user_id", 3], ["id", 8]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)